{
  "data": {
    "lesson": {
      "id": 906473,
      "key": "adbf2a15-5fa5-466b-a8fe-19ce08b82b61",
      "title": "Evaluate a News Article with Natural Language Processing",
      "semantic_type": "Lesson",
      "is_public": true,
      "version": "1.0.0",
      "locale": "en-us",
      "summary": "Build a web tool that allows users to run Natural Language Processing (NLP) on articles or blogs found on other websites.",
      "lesson_type": "Classroom",
      "display_workspace_project_only": false,
      "resources": null,
      "project": {
        "key": "391dad87-db77-43f8-a84d-348ec20f259e",
        "version": "1.0.0",
        "locale": "en-us",
        "duration": 30240,
        "semantic_type": "Project",
        "title": "Evaluate a News Article with Natural Language Processing",
        "description": "# Evaluate a News Article with Natural Language Processing\n\nThis project requires you to build a web tool that allows users to run Natural Language Processing (NLP) on articles or blogs found on other websites.\n\n## Rubric\n\nYour project will be evaluated by a Udacity code reviewer according to the [project rubric](https://review.udacity.com/#!/rubrics/2668/view). Please make sure to re-review the rubric for detailed project requirements prior to submission.\n\n## Submission\n\nOnce you've met all of the rubric requirements, you can submit your project as either a zip file or a Github repository link.",
        "is_public": true,
        "summary": null,
        "forum_path": "",
        "rubric_id": "2668",
        "terminal_project_id": null,
        "resources": null,
        "image": null
      },
      "lab": null,
      "concepts": [
        {
          "id": 906475,
          "key": "84dd3e36-517c-4683-8d46-78384355b372",
          "title": "Introduction",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "84dd3e36-517c-4683-8d46-78384355b372",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 1037305,
              "key": "1ed2bff9-900d-4b18-b1fd-df0c805da3f2",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Project Motivation\nThe motive of this project is to have you a taste of the environment and tools you will most likely come across in a front end role. Your focus should be to understand the role every tool and technology is playing in the overall architecture. You shouldn’t feel the need to memorize the particular commands, config setups, or structure that we create here. Every projetc in the industry will have its own custom setup, but *if you understand the moving pieces, you will be able to get the gist of even far more complicated projects than this one.* \n\n## Project Introduction - What You Will Build\nWe will build a web tool that allows users to run Natural Language Processing (NLP) on articles or blogs found on other websites. NLP is the ability of an application to understand the human language, written or oral.\n\nYou don't have to worry about NLP, because we will make use of an external api called [Aylien](https://aylien.com/) to interact with their NLP system. This tool will help us classify the information available in the article, like whether the content is subjective (opinion) or objective (fact-based) and whether it is positive, neutral, or negative in tone. \n\nFollowing are the project prerequisites: \n* Webserver - Node \n* Web application framework for routing - Express \n* Build tool - Webpack. Using webpack, we will set up the app to have dev and prod environments, each with their own set of tools and commands. \n* External script - Service Worker\n* External API - Aylien \n\n\n## Introduction to Natural Language Processing\nNLP is a subset of AI that provides computers ability to process or interact with natural human speech. In NLP, machine learning and deep learning are used on massive amounts of data to obtain the rules and understanding of nuance in human speech. \n\n#### NLP on Human Voice\nFor example, everyone who has used Alexa or Google Assistant or other voice command systems knows that these devices are always improving, by collecting and interpreting voice data. Verbal interactions can be incredibly hard to decipher. Sarcasm, for instance, requires understanding not just words and grammar but the tone as well, and regional accents and ways of saying things have to be taken into account, not to mention coverage for all the major languages. \n\n#### NLP on Text\nAn example is Grammarly editing tool, which parses the text that you write, and suggests if the tone is professional or not. Another example is the Smart Compose feature for Gmail that uses NLP to suggest words and statements based on your current context. \n\n\nIt requires a vast amount of knowledge from machine learning, deep learning, AI, statistics, and programming to create NLP systems and algorithms. \n**But, thankfully we will use a new API called Aylien, that has put a public-facing API in front of their NLP system. We will use it in our project to determine various attributes of an article or blog post.**",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 925478,
          "key": "5675966c-1a35-4d58-8715-e279d2303167",
          "title": "Instructions",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "5675966c-1a35-4d58-8715-e279d2303167",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 925479,
              "key": "376e00d0-5a2e-4200-a4d1-8625187163ba",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Project Instructions\nThis [Github repository](https://github.com/udacity/fend/tree/refresh-2019) is your starter code for the project. Clone the specific branch 'refresh-2019' or download the ZIP file, although feel free to start from scratch! It is the same as the starter code we began with in Lesson 2. Install and configure Webpack just as we did in the course. Feel free to refer to the course repo as you build this one, and remember to make frequent commits and to create and merge branches as necessary!\n\nThe goal of this project is to give you practice with:\n* Setting up Webpack\n* Sass styles\n* Webpack Loaders and Plugins\n* Creating layouts and page design\n* Service workers\n* Using APIs and creating requests to external URLs\n\nWe have divided the instructions into the following stages, as  explained below:",
              "instructor_notes": ""
            },
            {
              "id": 1037743,
              "key": "528b8c03-ed15-406d-93de-ab9d3b5f1eae",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Stage 1 - Getting Started - Setting up the Project\nIt would be good to first get your basic project up and functioning. Fork the project Github repo, and then clone or download the zip file locally. Remember that once you clone, you will still need to install everything:\n```\ncd <project directory>\nnpm install\n```\nFollow the steps from the course up to Lesson 4, but ***do not add Service Workers just yet***. We won't need the service workers during *development*, and having extra caches floating around just means there's more potential for confusion. Just for your quick reference, we installed the following loaders and plugins so far:\n```\n# Choose the necessary installation for your development mode\nnpm i -D @babel/core @babel/preset-env babel-loader\nnpm i -D style-loader node-sass css-loader sass-loader\nnpm i -D clean-webpack-plugin\nnpm i -D html-webpack-plugin\nnpm i -D mini-css-extract-plugin\nnpm i -D optimize-css-assets-webpack-plugin terser-webpack-plugin\n```\n\n",
              "instructor_notes": ""
            },
            {
              "id": 1037744,
              "key": "afc59fb7-78fc-4322-a050-f92475d9f524",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Stage 2 - Setting up the API\n\n**If you started this project on or before July 7, 2020,** you will be using the Aylien API for this project. The Aylien API has you install a node module to run certain commands through. It will simplify the requests we need to make from our node/express backend.\n\n**If you started this project after July 7, 2020,** you will be using the MeaningCloud Sentiment Analysis API for this project.\n\nThe [project rubric](https://review.udacity.com/#!/rubrics/2668/view) item for \"API\" criteria says:\n>The app should make a successful call to the API on form submission. If this is successful, the API keys and response handling were done correctly. You can check that the API keys are found in server.js or a similar node file. It is not acceptable for an API key to be set in a client-facing file (like index.js)\n\n>Information from the API response must show up in the view. It is not enough for the response to be logged to the console or saved in js, etc.\n\n#### Step 1: Sign up for an API key\n**For the Aylien API:** You will need to go to the [user signup page](https://developer.aylien.com/signup). Signing up will get you an API key. Don't worry, at the time of this course, the API is free to use up to 1000 requests per day or 333 intensive requests. It is free to check how many requests you have remaining for the day.\n\n**For the MeaningCloud API**: You can find the API [here](https://www.meaningcloud.com/developer/sentiment-analysis). Once you create an account with MeaningCloud, you will be given a license key to start using the API. This API does not require an SDK, so you can skip ahead to step 4 in the instructions.\n\n#### Step 2: Install the SDK (Aylien API only)\nNext, you'll need to get the Software Development Kit (SDK) for Node.js. SDK is usually a program that brings together various tools to help you work with a specific technology. For instance, the Aylien SDK brings together a bunch of tools and functions that will make it possible to interface with their API from our server. Aylien SDKs are available for all the major languages and platforms, such as Node, Python, PHP, Go, Ruby, and many others. \n\nInstall the SDK in your project, as per the instructions mentioned for **Node.js SDK** at [Text Analysis API Documentation](https://docs.aylien.com/textapi/sdks/#node-js-sdk).\n\n\n#### Step 3: Require the SDK package (Aylien API only)\nYour `server/index.js` file must have these things:\n```\n// Require the Aylien npm package\nvar aylien = require(\"aylien_textapi\");\n```\n",
              "instructor_notes": ""
            },
            {
              "id": 1037745,
              "key": "397c73f5-2eb1-426d-8e02-62fd19e18822",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "\n#### Step 4: Environment Variables\nNext, in `server/index.js`, you need to declare your API credentials, which will look something like this:\n```js\n// You could call it aylienapi, or anything else\nvar textapi = new aylien({\n  application_id: \"your-api-id\",\n  application_key: \"your-key\"\n});\n```\n**If you are using the MeaningCloud API**, the process will look pretty similar to the Aylien API process, but you don’t need to use an `application_id`.\n\n*...But there's a problem with this.* We are about to put our personal API keys into a file, but when we push, this file is going to be available PUBLICLY on Github. Private keys, visible publicly, are never a good thing. So, we have to figure out a way to make that not happen. \n\nThe way we will do that is with environment variables. Environment variables are pretty much like normal variables in that they have a name and hold value. The environment variables only belong to your local system and won't be visible when you push your code to a different environment like Github. Follow the steps below to configure environment variables:\n1. Use npm to install the dotenv package - `npm install dotenv` This will allow us to use environment variables we set in a new file\n2. Create a new `.env` file in the root of your project.\n3. Fill the `.env` file with your API keys like this:\n```\nAPI_ID=**************************\nAPI_KEY=**************************\n```\n4. Add this code to the very top of your `server/index.js` file:\n```\nconst dotenv = require('dotenv');\ndotenv.config();\n```\n5. If you want to refer the environment variables, try putting a prefix `process.env.` in front of the variable name in the `server/index.js` file, an example might look like this:\n```\nconsole.log(`Your API key is ${process.env.API_KEY}`);\n```\nThe step above is just to help you understand how to refer an environment variable from your code. In `server/index.js`, your updated API credential settings should look like this:\n```js\n// You could call it aylienapi, or anything else\nvar textapi = new aylien({\n      application_id: process.env.API_ID,\n      application_key: process.env.API_KEY\n});\n```\n6. Go to your `.gitignore` file, in the project root, and add `.env`. It will make sure that we don't push our environment variables to Github! If you forget this step, all of the work we did to protect our API keys would become pointless.",
              "instructor_notes": ""
            },
            {
              "id": 1037746,
              "key": "5c05e1a1-5256-4c19-9527-681d124ff7cb",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "#### Step 5: Using the API\nWe're ready to go! The Aylien API has a lot of different endpoints you can take a look at the [Aylien API endpoints](https://docs.aylien.com/textapi/endpoints/#api-endpoints). You can see how using the SDK simplifies the requests we need to make. You can also check out the documentation of the MeaningCloud API [here](https://www.meaningcloud.com/developer/sentiment-analysis/doc/2.1). MeaningCloud also has several other APIs, which we won’t be using for this project, but feel free to take a look around if you’re curious!\n\nNow it's up to you to create the various requests and make sure your server is set up appropriately. For example, ensure that the \"dependencies\" in `package.json`  have a suitable entry for Aylien, such as, `\"aylien_textapi\": \"^0.7.0\",`, where the version may vary with time.\n",
              "instructor_notes": ""
            },
            {
              "id": 1037747,
              "key": "eb502d8f-62b5-49fb-9121-78be4afa05d5",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Stage 3 - Project Enhancement\nAt the current stage, make enhancement in your project code to ensure most of the requirements as mentioned in the [project rubric](https://review.udacity.com/#!/rubrics/2668/view) are met. In addition, parse the response body to dynamically fill content on the page.\n\nOnly the rubric requirements related to \"Offline Functionality\" and \"Testing\" criteria should remain for the next stages.",
              "instructor_notes": ""
            },
            {
              "id": 1037749,
              "key": "add7dc6e-d013-4801-9969-bb8718aaa9c0",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Stage 4 - Unit Testing using Jest Framework\nYou must have read the rubric item for \"Testing\" criteria, that says:\n>Check that the project has Jest installed, that there is an npm script to run Jest, and that the tests all pass. Every src/client/js file should have at least one test.\n\n[Jest](https://jestjs.io/en/) is a framework for testing JavaScript projects. We are interested in the unit-testing of our project. The Jest framework provides us the ability to create, and run unit tests. In general, unit testing means to test the functionality of each unit/component of a project. But, in our case, we will write tests for desired functions defined in the src/client/js directory. The tests will check if the functions are behaving expectedly when provided an input. Let's learn to add Jest to your project to handle unit-testing. \n\n### How does it work?\n1. Install Jest by using  `npm install --save-dev jest`\n\n\n2. Write the custom JS in your src/client/js directory, responsible for the server, and form submission task. **For example**, assume that the `/src/client/js/formHandler.js` file has the following function to be tested:\n```js\nfunction handleSubmit(event) {\n       event.preventDefault()\n       // check what text was put into the form field\n       let formText = document.getElementById('name').value\n       Client.checkForName(formText)\n       console.log(\"::: Form Submitted :::\")\n}\nexport { handleSubmit }\n```\n",
              "instructor_notes": ""
            },
            {
              "id": 1037750,
              "key": "332bb2fc-511b-4da4-a77b-5514adcc69dd",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "3. **You have to ensure that all your custom functions in src/client/js directory can handle error responses if the user input does not match API requirements.** You will write tests in `<function_name>.test.js` or `<function_name>.spec.js` file, to be present in a `__test__` folder. For each functionality, consider writing a separate test file. The `__test__` folder should be present in the project directory.  \n\n In each test file, the general flow of the test block should be:\n * Import the js file to test\n * Define the input for the function. Note that, to keep it simple, we will not validate the input being provided to the test cases. \n * Define the expected output\n * Check if the function produces the expected output\n \n For the example function shown above, `/src/client/js/formHandler/handleSubmit()`, you can write a test file `testFormHandler.spec.js` in the `__test__` directory, having a test block as:\n```js\n// Import the js file to test\nimport { handleSubmit } from \"../src/client/js/formHandler\"\n```\n```\n// The describe() function takes two arguments - a string description, and a test suite as a callback function.  \n// A test suite may contain one or more related tests    \ndescribe(\"Testing the submit functionality\", () => {\n       // The test() function has two arguments - a string description, and an actual test as a callback function.  \n       test(\"Testing the handleSubmit() function\", () => {\n              // Define the input for the function, if any, in the form of variables/array\n              // Define the expected output, if any, in the form of variables/array\n              // The expect() function, in combination with a Jest matcher, is used to check if the function produces the expected output\n              // The general syntax is `expect(myFunction(arg1, arg2, ...)).toEqual(expectedValue);`, where `toEqual()` is a matcher\n              expect(handleSubmit).toBeDefined();\n})});\n```\nYou must be wondering about the matchers, and other syntactical information about test blocks. At this point, you must refer to the external resources:\n - [Jest - Getting started](https://jestjs.io/docs/en/getting-started) - Provides a basic overview, with the help of an example.\n - [Jest - matchers](https://jestjs.io/docs/en/using-matchers) - Read carefully to identify the suitable matcher for each of your functions.\n - [Jest - testing asynchronous code](https://jestjs.io/docs/en/asynchronous) - If you have code that runs asynchronously.\n - [A tutorial for beginners](https://www.valentinog.com/blog/jest/) - A good explanatory tutorial.\n",
              "instructor_notes": ""
            },
            {
              "id": 1037751,
              "key": "20def569-cef3-47cf-a2ba-1e02a953695a",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "4. Configure an npm script named \"test\" in `package.json` to run your tests from the command line:\n```js\n\"scripts\": {\n       \"test\": \"jest\"\n  }\n```\nAlso, ensure that the \"devDependencies\" in `package.json`  have a suitable entry for Jest and others, such as, `\"jest\": \"^25.3.0\",`, where the version may vary with time.\n\n\n5. Run the `npm run test` command.\n",
              "instructor_notes": ""
            },
            {
              "id": 1037752,
              "key": "40400030-8129-4a31-ad63-68713f680fc4",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Stage 5 - Service Workers\nThe rubric item for \"Offline Functionality\" criteria says:\n>The project must have set up service workers in webpack.\n\nGo to the webpack config file, and add the setup for service workers.  Test that the site should be available even when you stop your local server .",
              "instructor_notes": ""
            },
            {
              "id": 1037753,
              "key": "b8766fd5-e97f-4359-b904-21a77939039c",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Stage 6 - Deployment\nA great step to take with your finished project would be to deploy it! Unfortunately its a bit out of scope for me to explain too much about how to do that here, but check out [Netlify](https://www.netlify.com/) or [Heroku](https://www.heroku.com/) for some really intuitive free hosting options.",
              "instructor_notes": ""
            }
          ]
        }
      ]
    }
  }
}